c5/src/Catalogs/Items/Items.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Items</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Accuracy</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BOM</name>
    <type>
      <types>CatalogRef.BOM</types>
    </type>
  </attributes>
  <attributes>
    <name>CostMethod</name>
    <type>
      <types>EnumRef.Cost</types>
    </type>
  </attributes>
  <attributes>
    <name>CountPackages</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsGroup</name>
    <type>
      <types>CatalogRef.CustomsGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>Features</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </attributes>
  <attributes>
    <name>Form</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FullDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GroupsUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemsUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemType</name>
    <type>
      <types>CatalogRef.ItemTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ObjectUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>OfficialCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Package</name>
    <type>
      <types>CatalogRef.Packages</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceGroup</name>
    <type>
      <types>CatalogRef.PriceGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>Producer</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>Product</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Service</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Social</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>CatalogRef.TaxCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>Unit</name>
    <type>
      <types>CatalogRef.Units</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>CatalogRef.VAT</types>
    </type>
  </attributes>
  <attributes>
    <name>Weight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Properties</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.Properties</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.Properties</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/InformationRegisters/Barcodes/Barcodes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Barcodes</name>
  <resources>
    <name>Feature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </resources>
  <resources>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </resources>
  <resources>
    <name>Package</name>
    <type>
      <types>CatalogRef.Packages</types>
    </type>
  </resources>
  <dimensions>
    <name>Barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Catalogs/Items/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then
	
#region Printing

Function Print ( Params, Env ) export
	
	Print.SetFooter ( Params.TabDoc );
	setPageSettings ( Params );
	getData ( Params, Env );
	put ( Params, Env );
	return true;
	
EndFunction
 
Procedure setPageSettings ( Params )
	
	tabDoc = Params.TabDoc;
	tabDoc.PageOrientation = PageOrientation.Portrait;
	tabDoc.FitToPage = true;
	
EndProcedure 

Procedure getData ( Params, Env )
	
	s = "
	|// #Barcodes
	|select Barcodes.Barcode as Barcode, Barcodes.Feature.Description as Feature,
	|	Barcodes.Item.Description as Item, Package.Description as Package
	|from InformationRegister.Barcodes as Barcodes
	|where Barcodes.Item = &Item
	|";
	Env.Selection.Add ( s );
	Env.Q.SetParameter ( "Item", Params.Reference );
	SQL.Perform ( Env );
	
EndProcedure

Procedure put ( Params, Env )
	
	area = Env.T.GetArea ( "Row|Column" );
	space = Env.T.GetArea ( "Row|Space" );
	picture = area.Drawings.Barcode;
	p = PrintBarcodes.GetParams ();
	p.Width = picture.Width;
	p.Height = picture.Height;
	tabDoc = Params.TabDoc;
	for each row in Env.Barcodes do
		p.Barcode = row.Barcode;
		area.Drawings.Barcode.Picture = PrintBarcodes.GetPicture ( p );
		area.Parameters.Description = Print.FormatItem ( row.Item, row.Package, row.Feature ); 
		for i = 1 to 7 do
			for j = 1 to 3 do
				if ( j = 1 ) then
					tabDoc.Put ( area );
				else
					tabDoc.Join ( area );
				endif; 
				if ( j < 3 ) then
					tabDoc.Join ( space );
				endif; 
			enddo; 
		enddo; 
	enddo; 

EndProcedure

#endregion

#endif
